{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, null, null, 1], "dtype": "float32", "name": "input_1"}}, {"class_name": "Conv2D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "filters": 8, "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_1", "strides": [2, 2], "bias_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}}, {"class_name": "Conv2D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "filters": 8, "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_2", "strides": [1, 1], "bias_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}}, {"class_name": "Conv2D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "filters": 16, "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_3", "strides": [1, 1], "bias_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}}, {"class_name": "Conv2D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "filters": 16, "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_4", "strides": [2, 2], "bias_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}}, {"class_name": "Conv2D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "filters": 32, "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_5", "strides": [1, 1], "bias_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}}, {"class_name": "Conv2D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "filters": 32, "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_6", "strides": [2, 2], "bias_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}}, {"class_name": "UpSampling2D", "config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_1"}}, {"class_name": "Conv2D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "filters": 32, "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_7", "strides": [1, 1], "bias_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}}, {"class_name": "UpSampling2D", "config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_2"}}, {"class_name": "Conv2D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "filters": 16, "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_8", "strides": [1, 1], "bias_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}}, {"class_name": "UpSampling2D", "config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_3"}}, {"class_name": "Conv2D", "config": {"trainable": true, "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "filters": 2, "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_9", "strides": [1, 1], "bias_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}}], "keras_version": "2.1.6"}