{"class_name": "Sequential", "keras_version": "2.1.6", "config": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 1], "name": "input_1", "sparse": false, "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 8, "kernel_constraint": null, "trainable": true, "name": "conv2d_1", "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 8, "kernel_constraint": null, "trainable": true, "name": "conv2d_2", "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_constraint": null, "trainable": true, "name": "conv2d_3", "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_constraint": null, "trainable": true, "name": "conv2d_4", "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "kernel_constraint": null, "trainable": true, "name": "conv2d_5", "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "kernel_constraint": null, "trainable": true, "name": "conv2d_6", "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu"}}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "up_sampling2d_1", "data_format": "channels_last", "size": [2, 2]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "kernel_constraint": null, "trainable": true, "name": "conv2d_7", "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu"}}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "up_sampling2d_2", "data_format": "channels_last", "size": [2, 2]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_constraint": null, "trainable": true, "name": "conv2d_8", "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu"}}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "up_sampling2d_3", "data_format": "channels_last", "size": [2, 2]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "kernel_constraint": null, "trainable": true, "name": "conv2d_9", "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "sigmoid"}}], "backend": "tensorflow"}