{"config": [{"config": {"name": "input_1", "batch_input_shape": [null, null, null, 1], "dtype": "float32", "sparse": false}, "class_name": "InputLayer"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [2, 2], "dilation_rate": [1, 1], "name": "conv2d_1", "kernel_size": [3, 3], "trainable": true, "padding": "same", "activity_regularizer": null, "bias_constraint": null, "filters": 8, "activation": "relu", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_2", "kernel_size": [3, 3], "trainable": true, "padding": "same", "activity_regularizer": null, "bias_constraint": null, "filters": 8, "activation": "relu", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_3", "kernel_size": [3, 3], "trainable": true, "padding": "same", "activity_regularizer": null, "bias_constraint": null, "filters": 16, "activation": "relu", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [2, 2], "dilation_rate": [1, 1], "name": "conv2d_4", "kernel_size": [3, 3], "trainable": true, "padding": "same", "activity_regularizer": null, "bias_constraint": null, "filters": 16, "activation": "relu", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_5", "kernel_size": [3, 3], "trainable": true, "padding": "same", "activity_regularizer": null, "bias_constraint": null, "filters": 32, "activation": "relu", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [2, 2], "dilation_rate": [1, 1], "name": "conv2d_6", "kernel_size": [3, 3], "trainable": true, "padding": "same", "activity_regularizer": null, "bias_constraint": null, "filters": 32, "activation": "relu", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "up_sampling2d_1", "size": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "UpSampling2D"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_7", "kernel_size": [3, 3], "trainable": true, "padding": "same", "activity_regularizer": null, "bias_constraint": null, "filters": 32, "activation": "relu", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "up_sampling2d_2", "size": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "UpSampling2D"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_8", "kernel_size": [3, 3], "trainable": true, "padding": "same", "activity_regularizer": null, "bias_constraint": null, "filters": 16, "activation": "relu", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "up_sampling2d_3", "size": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "UpSampling2D"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_9", "kernel_size": [3, 3], "trainable": true, "padding": "same", "activity_regularizer": null, "bias_constraint": null, "filters": 32, "activation": "sigmoid", "use_bias": true}, "class_name": "Conv2D"}], "keras_version": "2.1.6", "class_name": "Sequential", "backend": "tensorflow"}