{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.6", "config": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 1], "dtype": "float32", "name": "input_1", "sparse": false}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [2, 2], "name": "conv2d_1", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 8, "use_bias": true, "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "name": "conv2d_2", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 8, "use_bias": true, "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "name": "conv2d_3", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "use_bias": true, "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [2, 2], "name": "conv2d_4", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "use_bias": true, "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "name": "conv2d_5", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "use_bias": true, "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [2, 2], "name": "conv2d_6", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "use_bias": true, "bias_regularizer": null}}, {"class_name": "Conv2DTranspose", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [2, 2], "name": "conv2d_transpose_1", "kernel_constraint": null, "kernel_size": [2, 2], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "use_bias": true, "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "name": "conv2d_7", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "use_bias": true, "bias_regularizer": null}}, {"class_name": "Conv2DTranspose", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [2, 2], "name": "conv2d_transpose_2", "kernel_constraint": null, "kernel_size": [2, 2], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "use_bias": true, "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "name": "conv2d_8", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "use_bias": true, "bias_regularizer": null}}, {"class_name": "Conv2DTranspose", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [2, 2], "name": "conv2d_transpose_3", "kernel_constraint": null, "kernel_size": [2, 2], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "use_bias": true, "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "name": "conv2d_9", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "activation": "sigmoid", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "use_bias": true, "bias_regularizer": null}}]}