{"config": [{"config": {"name": "input_1", "batch_input_shape": [null, null, null, 1], "dtype": "float32", "sparse": false}, "class_name": "InputLayer"}, {"config": {"name": "conv2d_1", "padding": "same", "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [2, 2], "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "filters": 8, "activation": "relu", "data_format": "channels_last", "kernel_regularizer": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"gamma_constraint": null, "epsilon": 0.001, "scale": true, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "name": "batch_normalization_1", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_1", "rate": 0.25, "seed": null, "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "conv2d_2", "padding": "same", "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "filters": 8, "activation": "relu", "data_format": "channels_last", "kernel_regularizer": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"gamma_constraint": null, "epsilon": 0.001, "scale": true, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "name": "batch_normalization_2", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_2", "rate": 0.25, "seed": null, "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "conv2d_3", "padding": "same", "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "filters": 16, "activation": "relu", "data_format": "channels_last", "kernel_regularizer": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"gamma_constraint": null, "epsilon": 0.001, "scale": true, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "name": "batch_normalization_3", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_3", "rate": 0.25, "seed": null, "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "conv2d_4", "padding": "same", "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [2, 2], "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "filters": 16, "activation": "relu", "data_format": "channels_last", "kernel_regularizer": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"gamma_constraint": null, "epsilon": 0.001, "scale": true, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "name": "batch_normalization_4", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_4", "rate": 0.25, "seed": null, "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "conv2d_5", "padding": "same", "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "filters": 32, "activation": "relu", "data_format": "channels_last", "kernel_regularizer": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"gamma_constraint": null, "epsilon": 0.001, "scale": true, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "name": "batch_normalization_5", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_5", "rate": 0.25, "seed": null, "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "conv2d_6", "padding": "same", "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [2, 2], "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "filters": 32, "activation": "relu", "data_format": "channels_last", "kernel_regularizer": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "up_sampling2d_1", "size": [2, 2], "data_format": "channels_last", "trainable": true}, "class_name": "UpSampling2D"}, {"config": {"gamma_constraint": null, "epsilon": 0.001, "scale": true, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "name": "batch_normalization_6", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_6", "rate": 0.25, "seed": null, "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "conv2d_7", "padding": "same", "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "filters": 32, "activation": "relu", "data_format": "channels_last", "kernel_regularizer": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "up_sampling2d_2", "size": [2, 2], "data_format": "channels_last", "trainable": true}, "class_name": "UpSampling2D"}, {"config": {"gamma_constraint": null, "epsilon": 0.001, "scale": true, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "name": "batch_normalization_7", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_7", "rate": 0.25, "seed": null, "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "conv2d_8", "padding": "same", "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "filters": 16, "activation": "relu", "data_format": "channels_last", "kernel_regularizer": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "up_sampling2d_3", "size": [2, 2], "data_format": "channels_last", "trainable": true}, "class_name": "UpSampling2D"}, {"config": {"gamma_constraint": null, "epsilon": 0.001, "scale": true, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "name": "batch_normalization_8", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "momentum": 0.99, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_8", "rate": 0.25, "seed": null, "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "conv2d_9", "padding": "same", "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "filters": 32, "activation": "sigmoid", "data_format": "channels_last", "kernel_regularizer": null, "trainable": true}, "class_name": "Conv2D"}], "keras_version": "2.1.6", "class_name": "Sequential", "backend": "tensorflow"}