{"class_name": "Sequential", "config": [{"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, null, null, 1], "name": "input_1"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "padding": "same", "filters": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1, 1], "strides": [2, 2], "name": "conv2d_1", "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_1", "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "padding": "same", "filters": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_2", "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_2", "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "padding": "same", "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_3", "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_3", "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "padding": "same", "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1, 1], "strides": [2, 2], "name": "conv2d_4", "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_4", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_4", "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "padding": "same", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_5", "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_5", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_5", "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "padding": "same", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1, 1], "strides": [2, 2], "name": "conv2d_6", "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3]}}, {"class_name": "Conv2DTranspose", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "padding": "same", "activity_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [2, 2], "name": "conv2d_transpose_1", "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [2, 2]}}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_6", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_6", "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "padding": "same", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_7", "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3]}}, {"class_name": "Conv2DTranspose", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "padding": "same", "activity_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [2, 2], "name": "conv2d_transpose_2", "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [2, 2]}}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_7", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_7", "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "padding": "same", "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_8", "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3]}}, {"class_name": "Conv2DTranspose", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "padding": "same", "activity_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [2, 2], "name": "conv2d_transpose_3", "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [2, 2]}}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_8", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_8", "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "padding": "same", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_9", "activation": "sigmoid", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3]}}], "keras_version": "2.1.6", "backend": "tensorflow"}