{"keras_version": "2.1.6", "backend": "tensorflow", "config": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, null, null, 1], "name": "input_1"}, "class_name": "InputLayer"}, {"config": {"padding": "same", "name": "conv2d_1", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 8, "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [2, 2]}, "class_name": "Conv2D"}, {"config": {"padding": "same", "name": "conv2d_2", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 8, "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"padding": "same", "name": "conv2d_3", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 16, "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"padding": "same", "name": "conv2d_4", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 16, "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [2, 2]}, "class_name": "Conv2D"}, {"config": {"padding": "same", "name": "conv2d_5", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"padding": "same", "name": "conv2d_6", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [2, 2]}, "class_name": "Conv2D"}, {"config": {"size": [2, 2], "name": "up_sampling2d_1", "trainable": true, "data_format": "channels_last"}, "class_name": "UpSampling2D"}, {"config": {"padding": "same", "name": "conv2d_7", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"size": [2, 2], "name": "up_sampling2d_2", "trainable": true, "data_format": "channels_last"}, "class_name": "UpSampling2D"}, {"config": {"padding": "same", "name": "conv2d_8", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 16, "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"size": [2, 2], "name": "up_sampling2d_3", "trainable": true, "data_format": "channels_last"}, "class_name": "UpSampling2D"}, {"config": {"padding": "same", "name": "conv2d_9", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1]}, "class_name": "Conv2D"}], "class_name": "Sequential"}