{"backend": "tensorflow", "keras_version": "2.1.6", "class_name": "Sequential", "config": [{"class_name": "InputLayer", "config": {"name": "input_1", "batch_input_shape": [null, null, null, 1], "dtype": "float32", "sparse": false}}, {"class_name": "Conv2D", "config": {"padding": "same", "bias_constraint": null, "use_bias": true, "activation": "relu", "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 8, "kernel_size": [3, 3], "data_format": "channels_last", "name": "conv2d_1", "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"padding": "same", "bias_constraint": null, "use_bias": true, "activation": "relu", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 8, "kernel_size": [3, 3], "data_format": "channels_last", "name": "conv2d_2", "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"padding": "same", "bias_constraint": null, "use_bias": true, "activation": "relu", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 16, "kernel_size": [3, 3], "data_format": "channels_last", "name": "conv2d_3", "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"padding": "same", "bias_constraint": null, "use_bias": true, "activation": "relu", "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 16, "kernel_size": [3, 3], "data_format": "channels_last", "name": "conv2d_4", "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"padding": "same", "bias_constraint": null, "use_bias": true, "activation": "relu", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 32, "kernel_size": [3, 3], "data_format": "channels_last", "name": "conv2d_5", "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"padding": "same", "bias_constraint": null, "use_bias": true, "activation": "relu", "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 32, "kernel_size": [3, 3], "data_format": "channels_last", "name": "conv2d_6", "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_1", "data_format": "channels_last", "trainable": true, "size": [2, 2]}}, {"class_name": "Conv2D", "config": {"padding": "same", "bias_constraint": null, "use_bias": true, "activation": "relu", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 32, "kernel_size": [3, 3], "data_format": "channels_last", "name": "conv2d_7", "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_2", "data_format": "channels_last", "trainable": true, "size": [2, 2]}}, {"class_name": "Conv2D", "config": {"padding": "same", "bias_constraint": null, "use_bias": true, "activation": "relu", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 16, "kernel_size": [3, 3], "data_format": "channels_last", "name": "conv2d_8", "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_3", "data_format": "channels_last", "trainable": true, "size": [2, 2]}}, {"class_name": "Conv2D", "config": {"padding": "same", "bias_constraint": null, "use_bias": true, "activation": "relu", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 2, "kernel_size": [3, 3], "data_format": "channels_last", "name": "conv2d_9", "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}]}