{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.6", "config": [{"class_name": "InputLayer", "config": {"name": "input_1", "batch_input_shape": [null, null, null, 1], "sparse": false, "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "trainable": true, "padding": "same", "bias_constraint": null, "name": "conv2d_1", "activity_regularizer": null, "activation": "relu", "use_bias": true, "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "filters": 8, "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "trainable": true, "padding": "same", "bias_constraint": null, "name": "conv2d_2", "activity_regularizer": null, "activation": "relu", "use_bias": true, "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "filters": 8, "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "trainable": true, "padding": "same", "bias_constraint": null, "name": "conv2d_3", "activity_regularizer": null, "activation": "relu", "use_bias": true, "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "filters": 16, "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "trainable": true, "padding": "same", "bias_constraint": null, "name": "conv2d_4", "activity_regularizer": null, "activation": "relu", "use_bias": true, "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "filters": 16, "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "trainable": true, "padding": "same", "bias_constraint": null, "name": "conv2d_5", "activity_regularizer": null, "activation": "relu", "use_bias": true, "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "filters": 32, "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "trainable": true, "padding": "same", "bias_constraint": null, "name": "conv2d_6", "activity_regularizer": null, "activation": "relu", "use_bias": true, "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "filters": 32, "kernel_regularizer": null}}, {"class_name": "UpSampling2D", "config": {"data_format": "channels_last", "name": "up_sampling2d_1", "size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "trainable": true, "padding": "same", "bias_constraint": null, "name": "conv2d_7", "activity_regularizer": null, "activation": "relu", "use_bias": true, "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "filters": 32, "kernel_regularizer": null}}, {"class_name": "UpSampling2D", "config": {"data_format": "channels_last", "name": "up_sampling2d_2", "size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "trainable": true, "padding": "same", "bias_constraint": null, "name": "conv2d_8", "activity_regularizer": null, "activation": "relu", "use_bias": true, "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "filters": 16, "kernel_regularizer": null}}, {"class_name": "UpSampling2D", "config": {"data_format": "channels_last", "name": "up_sampling2d_3", "size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "trainable": true, "padding": "same", "bias_constraint": null, "name": "conv2d_9", "activity_regularizer": null, "activation": "sigmoid", "use_bias": true, "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "filters": 32, "kernel_regularizer": null}}]}