{"backend": "tensorflow", "config": [{"config": {"name": "input_1", "batch_input_shape": [null, null, null, 1], "sparse": false, "dtype": "float32"}, "class_name": "InputLayer"}, {"config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_1", "bias_constraint": null, "activation": "relu", "filters": 8, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "strides": [2, 2], "activity_regularizer": null, "use_bias": true, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_2", "bias_constraint": null, "activation": "relu", "filters": 8, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_3", "bias_constraint": null, "activation": "relu", "filters": 16, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_4", "bias_constraint": null, "activation": "relu", "filters": 16, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "strides": [2, 2], "activity_regularizer": null, "use_bias": true, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_5", "bias_constraint": null, "activation": "relu", "filters": 32, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_6", "bias_constraint": null, "activation": "relu", "filters": 32, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "strides": [2, 2], "activity_regularizer": null, "use_bias": true, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"name": "up_sampling2d_1", "size": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "UpSampling2D"}, {"config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_7", "bias_constraint": null, "activation": "relu", "filters": 32, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"name": "up_sampling2d_2", "size": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "UpSampling2D"}, {"config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_8", "bias_constraint": null, "activation": "relu", "filters": 16, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"name": "up_sampling2d_3", "size": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "UpSampling2D"}, {"config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_9", "bias_constraint": null, "activation": "sigmoid", "filters": 32, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_size": [3, 3]}, "class_name": "Conv2D"}], "class_name": "Sequential", "keras_version": "2.1.6"}