{"class_name": "Sequential", "keras_version": "2.1.6", "backend": "tensorflow", "config": [{"class_name": "InputLayer", "config": {"name": "input_1", "dtype": "float32", "batch_input_shape": [null, null, null, 1], "sparse": false}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 8, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "use_bias": true, "activation": "relu", "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 8, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "use_bias": true, "activation": "relu", "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_3", "use_bias": true, "activation": "relu", "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_4", "use_bias": true, "activation": "relu", "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_5", "use_bias": true, "activation": "relu", "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_6", "use_bias": true, "activation": "relu", "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2DTranspose", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [2, 2], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_transpose_1", "use_bias": true, "activation": "relu", "padding": "same", "bias_constraint": null, "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_7", "use_bias": true, "activation": "relu", "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1]}}, {"class_name": "Conv2DTranspose", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [2, 2], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_transpose_2", "use_bias": true, "activation": "relu", "padding": "same", "bias_constraint": null, "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_8", "use_bias": true, "activation": "relu", "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1]}}, {"class_name": "Conv2DTranspose", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [2, 2], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_transpose_3", "use_bias": true, "activation": "relu", "padding": "same", "bias_constraint": null, "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_9", "use_bias": true, "activation": "sigmoid", "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1]}}]}