{"config": [{"config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, null, null, 1], "sparse": false}, "class_name": "InputLayer"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "use_bias": true, "strides": [2, 2], "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_1", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "filters": 8, "kernel_size": [3, 3], "activation": "relu", "padding": "same"}, "class_name": "Conv2D"}, {"config": {"momentum": 0.99, "center": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_1", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "beta_constraint": null, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_1", "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_2", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "filters": 8, "kernel_size": [3, 3], "activation": "relu", "padding": "same"}, "class_name": "Conv2D"}, {"config": {"momentum": 0.99, "center": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_2", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "beta_constraint": null, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_2", "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_3", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "filters": 16, "kernel_size": [3, 3], "activation": "relu", "padding": "same"}, "class_name": "Conv2D"}, {"config": {"momentum": 0.99, "center": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_3", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "beta_constraint": null, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_3", "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "use_bias": true, "strides": [2, 2], "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_4", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "filters": 16, "kernel_size": [3, 3], "activation": "relu", "padding": "same"}, "class_name": "Conv2D"}, {"config": {"momentum": 0.99, "center": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_4", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "beta_constraint": null, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_4", "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_5", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "filters": 32, "kernel_size": [3, 3], "activation": "relu", "padding": "same"}, "class_name": "Conv2D"}, {"config": {"momentum": 0.99, "center": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_5", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "beta_constraint": null, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_5", "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "use_bias": true, "strides": [2, 2], "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_6", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "filters": 32, "kernel_size": [3, 3], "activation": "relu", "padding": "same"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_1", "size": [2, 2]}, "class_name": "UpSampling2D"}, {"config": {"momentum": 0.99, "center": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_6", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "beta_constraint": null, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_6", "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_7", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "filters": 32, "kernel_size": [3, 3], "activation": "relu", "padding": "same"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_2", "size": [2, 2]}, "class_name": "UpSampling2D"}, {"config": {"momentum": 0.99, "center": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_7", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "beta_constraint": null, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_7", "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_8", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "filters": 16, "kernel_size": [3, 3], "activation": "relu", "padding": "same"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_3", "size": [2, 2]}, "class_name": "UpSampling2D"}, {"config": {"momentum": 0.99, "center": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_8", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "beta_constraint": null, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_8", "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_9", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "filters": 32, "kernel_size": [3, 3], "activation": "sigmoid", "padding": "same"}, "class_name": "Conv2D"}], "backend": "tensorflow", "keras_version": "2.1.6", "class_name": "Sequential"}