{"keras_version": "2.1.6", "config": [{"class_name": "InputLayer", "config": {"name": "input_1", "dtype": "float32", "sparse": false, "batch_input_shape": [null, null, null, 1]}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "filters": 8, "trainable": true, "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_1", "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "scale": true, "gamma_constraint": null, "trainable": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "epsilon": 0.001, "beta_regularizer": null, "beta_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.25}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "filters": 8, "trainable": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_2", "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "scale": true, "gamma_constraint": null, "trainable": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "epsilon": 0.001, "beta_regularizer": null, "beta_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.25}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "filters": 16, "trainable": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_3", "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "scale": true, "gamma_constraint": null, "trainable": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "epsilon": 0.001, "beta_regularizer": null, "beta_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.25}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "filters": 16, "trainable": true, "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_4", "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "scale": true, "gamma_constraint": null, "trainable": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "epsilon": 0.001, "beta_regularizer": null, "beta_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.25}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "filters": 32, "trainable": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_5", "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "scale": true, "gamma_constraint": null, "trainable": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "epsilon": 0.001, "beta_regularizer": null, "beta_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.25}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "filters": 32, "trainable": true, "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_6", "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Conv2DTranspose", "config": {"kernel_size": [2, 2], "padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "filters": 32, "trainable": true, "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_transpose_1", "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "scale": true, "gamma_constraint": null, "trainable": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "epsilon": 0.001, "beta_regularizer": null, "beta_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.25}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "filters": 32, "trainable": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_7", "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Conv2DTranspose", "config": {"kernel_size": [2, 2], "padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "filters": 32, "trainable": true, "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_transpose_2", "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "scale": true, "gamma_constraint": null, "trainable": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "epsilon": 0.001, "beta_regularizer": null, "beta_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.25}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "filters": 16, "trainable": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_8", "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Conv2DTranspose", "config": {"kernel_size": [2, 2], "padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "filters": 32, "trainable": true, "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_transpose_3", "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1, "scale": true, "gamma_constraint": null, "trainable": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8", "epsilon": 0.001, "beta_regularizer": null, "beta_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_8", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.25}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "use_bias": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "filters": 32, "trainable": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_9", "activity_regularizer": null, "bias_regularizer": null}}], "class_name": "Sequential", "backend": "tensorflow"}