{"config": [{"config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, null, null, 1], "name": "input_1"}, "class_name": "InputLayer"}, {"config": {"activity_regularizer": null, "filters": 8, "dilation_rate": [1, 1], "bias_constraint": null, "strides": [2, 2], "bias_regularizer": null, "trainable": true, "data_format": "channels_last", "activation": "relu", "name": "conv2d_1", "padding": "same", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "filters": 8, "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "data_format": "channels_last", "activation": "relu", "name": "conv2d_2", "padding": "same", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "filters": 16, "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "data_format": "channels_last", "activation": "relu", "name": "conv2d_3", "padding": "same", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "filters": 16, "dilation_rate": [1, 1], "bias_constraint": null, "strides": [2, 2], "bias_regularizer": null, "trainable": true, "data_format": "channels_last", "activation": "relu", "name": "conv2d_4", "padding": "same", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "data_format": "channels_last", "activation": "relu", "name": "conv2d_5", "padding": "same", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "bias_constraint": null, "strides": [2, 2], "bias_regularizer": null, "trainable": true, "data_format": "channels_last", "activation": "relu", "name": "conv2d_6", "padding": "same", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "up_sampling2d_1"}, "class_name": "UpSampling2D"}, {"config": {"activity_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "data_format": "channels_last", "activation": "relu", "name": "conv2d_7", "padding": "same", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "up_sampling2d_2"}, "class_name": "UpSampling2D"}, {"config": {"activity_regularizer": null, "filters": 16, "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "data_format": "channels_last", "activation": "relu", "name": "conv2d_8", "padding": "same", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "up_sampling2d_3"}, "class_name": "UpSampling2D"}, {"config": {"activity_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "data_format": "channels_last", "activation": "sigmoid", "name": "conv2d_9", "padding": "same", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}], "keras_version": "2.1.6", "class_name": "Sequential", "backend": "tensorflow"}