{"keras_version": "2.1.6", "config": [{"config": {"sparse": false, "batch_input_shape": [null, null, null, 1], "name": "input_1", "dtype": "float32"}, "class_name": "InputLayer"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "filters": 8, "name": "conv2d_1", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "use_bias": true, "data_format": "channels_last", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "strides": [2, 2]}, "class_name": "Conv2D"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "filters": 8, "name": "conv2d_2", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "use_bias": true, "data_format": "channels_last", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "filters": 16, "name": "conv2d_3", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "use_bias": true, "data_format": "channels_last", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "filters": 16, "name": "conv2d_4", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "use_bias": true, "data_format": "channels_last", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "strides": [2, 2]}, "class_name": "Conv2D"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "filters": 32, "name": "conv2d_5", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "use_bias": true, "data_format": "channels_last", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "filters": 32, "name": "conv2d_6", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "use_bias": true, "data_format": "channels_last", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "strides": [2, 2]}, "class_name": "Conv2D"}, {"config": {"size": [2, 2], "trainable": true, "name": "up_sampling2d_1", "data_format": "channels_last"}, "class_name": "UpSampling2D"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "filters": 32, "name": "conv2d_7", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "use_bias": true, "data_format": "channels_last", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"size": [2, 2], "trainable": true, "name": "up_sampling2d_2", "data_format": "channels_last"}, "class_name": "UpSampling2D"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "filters": 16, "name": "conv2d_8", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "use_bias": true, "data_format": "channels_last", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"size": [2, 2], "trainable": true, "name": "up_sampling2d_3", "data_format": "channels_last"}, "class_name": "UpSampling2D"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "filters": 32, "name": "conv2d_9", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "activation": "sigmoid", "use_bias": true, "data_format": "channels_last", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "strides": [1, 1]}, "class_name": "Conv2D"}], "class_name": "Sequential", "backend": "tensorflow"}