{"class_name": "Sequential", "keras_version": "2.1.6", "backend": "tensorflow", "config": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 1], "dtype": "float32", "sparse": false, "name": "input_1"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "filters": 8, "kernel_size": [3, 3], "padding": "same", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "filters": 8, "kernel_size": [3, 3], "padding": "same", "trainable": true, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_3", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "filters": 16, "kernel_size": [3, 3], "padding": "same", "trainable": true, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_4", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "filters": 16, "kernel_size": [3, 3], "padding": "same", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_5", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "filters": 32, "kernel_size": [3, 3], "padding": "same", "trainable": true, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_6", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "filters": 32, "kernel_size": [3, 3], "padding": "same", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "bias_regularizer": null}}, {"class_name": "UpSampling2D", "config": {"trainable": true, "size": [2, 2], "name": "up_sampling2d_1", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_7", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "filters": 32, "kernel_size": [3, 3], "padding": "same", "trainable": true, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null}}, {"class_name": "UpSampling2D", "config": {"trainable": true, "size": [2, 2], "name": "up_sampling2d_2", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_8", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "filters": 16, "kernel_size": [3, 3], "padding": "same", "trainable": true, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null}}, {"class_name": "UpSampling2D", "config": {"trainable": true, "size": [2, 2], "name": "up_sampling2d_3", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_9", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "filters": 2, "kernel_size": [3, 3], "padding": "same", "trainable": true, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null}}]}