{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "InputLayer", "config": {"name": "input_1", "batch_input_shape": [null, null, null, 1], "dtype": "float32", "sparse": false}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 8, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "activity_regularizer": null, "name": "conv2d_1", "trainable": true, "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 8, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "activity_regularizer": null, "name": "conv2d_2", "trainable": true, "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 16, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "activity_regularizer": null, "name": "conv2d_3", "trainable": true, "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 16, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "activity_regularizer": null, "name": "conv2d_4", "trainable": true, "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 32, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "activity_regularizer": null, "name": "conv2d_5", "trainable": true, "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 32, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "activity_regularizer": null, "name": "conv2d_6", "trainable": true, "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "strides": [2, 2]}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_1", "trainable": true, "data_format": "channels_last", "size": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 32, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "activity_regularizer": null, "name": "conv2d_7", "trainable": true, "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "strides": [1, 1]}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_2", "trainable": true, "data_format": "channels_last", "size": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 16, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "activity_regularizer": null, "name": "conv2d_8", "trainable": true, "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "strides": [1, 1]}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_3", "trainable": true, "data_format": "channels_last", "size": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 32, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "activity_regularizer": null, "name": "conv2d_9", "trainable": true, "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "strides": [1, 1]}}], "keras_version": "2.1.6"}