{"keras_version": "2.1.6", "backend": "tensorflow", "config": [{"config": {"batch_input_shape": [null, null, null, 1], "dtype": "float32", "sparse": false, "name": "input_1"}, "class_name": "InputLayer"}, {"config": {"trainable": true, "data_format": "channels_last", "activation": "relu", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "filters": 8, "use_bias": true, "strides": [2, 2], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "conv2d_1", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "activation": "relu", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "filters": 8, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "conv2d_2", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "activation": "relu", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "filters": 16, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "conv2d_3", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "activation": "relu", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "filters": 16, "use_bias": true, "strides": [2, 2], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "conv2d_4", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "activation": "relu", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "filters": 32, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "conv2d_5", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "activation": "relu", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "filters": 32, "use_bias": true, "strides": [2, 2], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "conv2d_6", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "activation": "relu", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "use_bias": true, "strides": [2, 2], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "conv2d_transpose_1", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [2, 2]}, "class_name": "Conv2DTranspose"}, {"config": {"trainable": true, "data_format": "channels_last", "activation": "relu", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "filters": 32, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "conv2d_7", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "activation": "relu", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "use_bias": true, "strides": [2, 2], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "conv2d_transpose_2", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [2, 2]}, "class_name": "Conv2DTranspose"}, {"config": {"trainable": true, "data_format": "channels_last", "activation": "relu", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "filters": 16, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "conv2d_8", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "activation": "relu", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "use_bias": true, "strides": [2, 2], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "conv2d_transpose_3", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [2, 2]}, "class_name": "Conv2DTranspose"}, {"config": {"trainable": true, "data_format": "channels_last", "activation": "sigmoid", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "filters": 32, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "conv2d_9", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}], "class_name": "Sequential"}