{"class_name": "Sequential", "keras_version": "2.1.6", "config": [{"class_name": "InputLayer", "config": {"name": "input_1", "batch_input_shape": [null, null, null, 1], "dtype": "float32", "sparse": false}}, {"class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 8, "activation": "relu", "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_1", "kernel_regularizer": null, "use_bias": true, "strides": [2, 2], "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "gamma_regularizer": null, "scale": true, "center": true, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_1", "trainable": true, "rate": 0.25, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 8, "activation": "relu", "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_2", "kernel_regularizer": null, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2", "gamma_regularizer": null, "scale": true, "center": true, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_2", "trainable": true, "rate": 0.25, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 16, "activation": "relu", "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_3", "kernel_regularizer": null, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3", "gamma_regularizer": null, "scale": true, "center": true, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_3", "trainable": true, "rate": 0.25, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 16, "activation": "relu", "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_4", "kernel_regularizer": null, "use_bias": true, "strides": [2, 2], "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_4", "gamma_regularizer": null, "scale": true, "center": true, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_4", "trainable": true, "rate": 0.25, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 32, "activation": "relu", "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_5", "kernel_regularizer": null, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_5", "gamma_regularizer": null, "scale": true, "center": true, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_5", "trainable": true, "rate": 0.25, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 32, "activation": "relu", "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_6", "kernel_regularizer": null, "use_bias": true, "strides": [2, 2], "dilation_rate": [1, 1]}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_1", "size": [2, 2], "data_format": "channels_last", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_6", "gamma_regularizer": null, "scale": true, "center": true, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_6", "trainable": true, "rate": 0.25, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 32, "activation": "relu", "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_7", "kernel_regularizer": null, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1]}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_2", "size": [2, 2], "data_format": "channels_last", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_7", "gamma_regularizer": null, "scale": true, "center": true, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_7", "trainable": true, "rate": 0.25, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 16, "activation": "relu", "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_8", "kernel_regularizer": null, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1]}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_3", "size": [2, 2], "data_format": "channels_last", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_8", "gamma_regularizer": null, "scale": true, "center": true, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_8", "trainable": true, "rate": 0.25, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 32, "activation": "sigmoid", "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_9", "kernel_regularizer": null, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1]}}], "backend": "tensorflow"}