{"backend": "tensorflow", "keras_version": "2.1.6", "class_name": "Sequential", "config": [{"class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, null, null, 1], "sparse": false}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 8, "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_1", "kernel_size": [3, 3], "strides": [2, 2], "use_bias": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 8, "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_2", "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 16, "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_3", "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 16, "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_4", "kernel_size": [3, 3], "strides": [2, 2], "use_bias": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_5", "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_6", "kernel_size": [3, 3], "strides": [2, 2], "use_bias": true}}, {"class_name": "Conv2DTranspose", "config": {"kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 32, "kernel_constraint": null, "padding": "same", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_transpose_1", "kernel_size": [2, 2], "strides": [2, 2], "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "axis": -1, "gamma_regularizer": null, "trainable": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.5, "noise_shape": null, "trainable": true, "seed": null}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_7", "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true}}, {"class_name": "Conv2DTranspose", "config": {"kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 32, "kernel_constraint": null, "padding": "same", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_transpose_2", "kernel_size": [2, 2], "strides": [2, 2], "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "axis": -1, "gamma_regularizer": null, "trainable": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.5, "noise_shape": null, "trainable": true, "seed": null}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 16, "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_8", "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true}}, {"class_name": "Conv2DTranspose", "config": {"kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 32, "kernel_constraint": null, "padding": "same", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_transpose_3", "kernel_size": [2, 2], "strides": [2, 2], "use_bias": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_9", "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true}}]}