{"config": [{"config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, null, null, 1], "name": "input_1"}, "class_name": "InputLayer"}, {"config": {"kernel_regularizer": null, "strides": [2, 2], "data_format": "channels_last", "name": "conv2d_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "filters": 8, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"kernel_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "name": "conv2d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "filters": 8, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"kernel_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "name": "conv2d_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "filters": 16, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"kernel_regularizer": null, "strides": [2, 2], "data_format": "channels_last", "name": "conv2d_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "filters": 16, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"kernel_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "name": "conv2d_5", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "filters": 32, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"kernel_regularizer": null, "strides": [2, 2], "data_format": "channels_last", "name": "conv2d_6", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "filters": 32, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "up_sampling2d_1", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "class_name": "UpSampling2D"}, {"config": {"kernel_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "name": "conv2d_7", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "filters": 32, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "up_sampling2d_2", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "class_name": "UpSampling2D"}, {"config": {"kernel_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "name": "conv2d_8", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "filters": 16, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "up_sampling2d_3", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "class_name": "UpSampling2D"}, {"config": {"kernel_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "name": "conv2d_9", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "sigmoid", "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "filters": 32, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Conv2D"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.6"}