{"backend": "tensorflow", "keras_version": "2.1.6", "config": [{"config": {"sparse": false, "dtype": "float32", "name": "input_1", "batch_input_shape": [null, null, null, 1]}, "class_name": "InputLayer"}, {"config": {"kernel_size": [3, 3], "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "padding": "same", "strides": [2, 2], "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "filters": 8, "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "padding": "same", "strides": [1, 1], "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "filters": 8, "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_3", "padding": "same", "strides": [1, 1], "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "filters": 16, "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_4", "padding": "same", "strides": [2, 2], "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "filters": 16, "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_5", "padding": "same", "strides": [1, 1], "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_6", "padding": "same", "strides": [2, 2], "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "trainable": true, "size": [2, 2], "name": "up_sampling2d_1"}, "class_name": "UpSampling2D"}, {"config": {"kernel_size": [3, 3], "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_7", "padding": "same", "strides": [1, 1], "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "trainable": true, "size": [2, 2], "name": "up_sampling2d_2"}, "class_name": "UpSampling2D"}, {"config": {"kernel_size": [3, 3], "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_8", "padding": "same", "strides": [1, 1], "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "filters": 16, "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "trainable": true, "size": [2, 2], "name": "up_sampling2d_3"}, "class_name": "UpSampling2D"}, {"config": {"kernel_size": [3, 3], "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_9", "padding": "same", "strides": [1, 1], "activity_regularizer": null, "activation": "sigmoid", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}], "class_name": "Sequential"}