{"keras_version": "2.1.6", "config": [{"config": {"sparse": false, "batch_input_shape": [null, null, null, 1], "dtype": "float32", "name": "input_1"}, "class_name": "InputLayer"}, {"config": {"filters": 8, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "conv2d_1", "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "strides": [2, 2]}, "class_name": "Conv2D"}, {"config": {"filters": 8, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "conv2d_2", "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"filters": 16, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "conv2d_3", "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"filters": 16, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "conv2d_4", "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "strides": [2, 2]}, "class_name": "Conv2D"}, {"config": {"filters": 32, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "conv2d_5", "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"filters": 32, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "conv2d_6", "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "strides": [2, 2]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_1", "size": [2, 2]}, "class_name": "UpSampling2D"}, {"config": {"filters": 32, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "conv2d_7", "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_2", "size": [2, 2]}, "class_name": "UpSampling2D"}, {"config": {"filters": 16, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "conv2d_8", "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_3", "size": [2, 2]}, "class_name": "UpSampling2D"}, {"config": {"filters": 32, "kernel_regularizer": null, "kernel_constraint": null, "activation": "sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "conv2d_9", "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1]}, "class_name": "Conv2D"}], "class_name": "Sequential", "backend": "tensorflow"}