{"keras_version": "2.1.6", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 1], "dtype": "float32", "name": "input_1", "sparse": false}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_1", "filters": 8, "bias_constraint": null, "data_format": "channels_last", "activation": "relu", "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "strides": [2, 2], "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_2", "filters": 8, "bias_constraint": null, "data_format": "channels_last", "activation": "relu", "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_3", "filters": 16, "bias_constraint": null, "data_format": "channels_last", "activation": "relu", "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_4", "filters": 16, "bias_constraint": null, "data_format": "channels_last", "activation": "relu", "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "strides": [2, 2], "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_5", "filters": 32, "bias_constraint": null, "data_format": "channels_last", "activation": "relu", "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_6", "filters": 32, "bias_constraint": null, "data_format": "channels_last", "activation": "relu", "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "strides": [2, 2], "activity_regularizer": null}}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "up_sampling2d_1"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_7", "filters": 32, "bias_constraint": null, "data_format": "channels_last", "activation": "relu", "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null}}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "up_sampling2d_2"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_8", "filters": 16, "bias_constraint": null, "data_format": "channels_last", "activation": "relu", "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null}}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "up_sampling2d_3"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_9", "filters": 2, "bias_constraint": null, "data_format": "channels_last", "activation": "relu", "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null}}]}