{"keras_version": "2.1.6", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, null, null, 1], "name": "input_1"}}, {"class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_1", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [2, 2], "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "padding": "same", "filters": 8}}, {"class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_2", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "padding": "same", "filters": 8}}, {"class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_3", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "padding": "same", "filters": 16}}, {"class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_4", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [2, 2], "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "padding": "same", "filters": 16}}, {"class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_5", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "padding": "same", "filters": 32}}, {"class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_6", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [2, 2], "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "padding": "same", "filters": 32}}, {"class_name": "UpSampling2D", "config": {"trainable": true, "size": [2, 2], "name": "up_sampling2d_1", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_7", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "padding": "same", "filters": 32}}, {"class_name": "UpSampling2D", "config": {"trainable": true, "size": [2, 2], "name": "up_sampling2d_2", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_8", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "padding": "same", "filters": 16}}, {"class_name": "UpSampling2D", "config": {"trainable": true, "size": [2, 2], "name": "up_sampling2d_3", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_9", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "padding": "same", "filters": 32}}]}