{"backend": "tensorflow", "keras_version": "2.1.6", "class_name": "Sequential", "config": [{"class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "name": "input_1", "batch_input_shape": [null, null, null, 1]}}, {"class_name": "Conv2D", "config": {"filters": 8, "strides": [2, 2], "data_format": "channels_last", "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "use_bias": true, "activation": "relu", "padding": "same", "dilation_rate": [1, 1], "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null}}, {"class_name": "Conv2D", "config": {"filters": 8, "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "use_bias": true, "activation": "relu", "padding": "same", "dilation_rate": [1, 1], "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null}}, {"class_name": "Conv2D", "config": {"filters": 16, "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "use_bias": true, "activation": "relu", "padding": "same", "dilation_rate": [1, 1], "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null}}, {"class_name": "Conv2D", "config": {"filters": 16, "strides": [2, 2], "data_format": "channels_last", "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "use_bias": true, "activation": "relu", "padding": "same", "dilation_rate": [1, 1], "name": "conv2d_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null}}, {"class_name": "Conv2D", "config": {"filters": 32, "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "use_bias": true, "activation": "relu", "padding": "same", "dilation_rate": [1, 1], "name": "conv2d_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null}}, {"class_name": "Conv2D", "config": {"filters": 32, "strides": [2, 2], "data_format": "channels_last", "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "use_bias": true, "activation": "relu", "padding": "same", "dilation_rate": [1, 1], "name": "conv2d_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_1", "size": [2, 2], "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "config": {"filters": 32, "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "use_bias": true, "activation": "relu", "padding": "same", "dilation_rate": [1, 1], "name": "conv2d_7", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_2", "size": [2, 2], "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "config": {"filters": 16, "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "use_bias": true, "activation": "relu", "padding": "same", "dilation_rate": [1, 1], "name": "conv2d_8", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_3", "size": [2, 2], "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "config": {"filters": 32, "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "use_bias": true, "activation": "sigmoid", "padding": "same", "dilation_rate": [1, 1], "name": "conv2d_9", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null}}]}