{"config": [{"config": {"batch_input_shape": [null, null, null, 1], "sparse": false, "dtype": "float32", "name": "input_1"}, "class_name": "InputLayer"}, {"config": {"kernel_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "bias_constraint": null, "data_format": "channels_last", "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "name": "conv2d_1", "strides": [2, 2], "kernel_regularizer": null, "activity_regularizer": null, "filters": 8, "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "bias_constraint": null, "data_format": "channels_last", "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "name": "conv2d_2", "strides": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "filters": 8, "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "bias_constraint": null, "data_format": "channels_last", "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "name": "conv2d_3", "strides": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "filters": 16, "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "bias_constraint": null, "data_format": "channels_last", "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "name": "conv2d_4", "strides": [2, 2], "kernel_regularizer": null, "activity_regularizer": null, "filters": 16, "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "bias_constraint": null, "data_format": "channels_last", "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "name": "conv2d_5", "strides": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "filters": 32, "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "bias_constraint": null, "data_format": "channels_last", "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "name": "conv2d_6", "strides": [2, 2], "kernel_regularizer": null, "activity_regularizer": null, "filters": 32, "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "bias_constraint": null, "data_format": "channels_last", "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "conv2d_transpose_1", "strides": [2, 2], "kernel_regularizer": null, "filters": 32, "bias_regularizer": null, "kernel_size": [2, 2], "use_bias": true}, "class_name": "Conv2DTranspose"}, {"config": {"kernel_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "bias_constraint": null, "data_format": "channels_last", "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "name": "conv2d_7", "strides": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "filters": 32, "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "bias_constraint": null, "data_format": "channels_last", "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "conv2d_transpose_2", "strides": [2, 2], "kernel_regularizer": null, "filters": 32, "bias_regularizer": null, "kernel_size": [2, 2], "use_bias": true}, "class_name": "Conv2DTranspose"}, {"config": {"kernel_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "bias_constraint": null, "data_format": "channels_last", "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "name": "conv2d_8", "strides": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "filters": 16, "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "bias_constraint": null, "data_format": "channels_last", "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "conv2d_transpose_3", "strides": [2, 2], "kernel_regularizer": null, "filters": 32, "bias_regularizer": null, "kernel_size": [2, 2], "use_bias": true}, "class_name": "Conv2DTranspose"}, {"config": {"kernel_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "sigmoid", "bias_constraint": null, "data_format": "channels_last", "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "name": "conv2d_9", "strides": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "filters": 32, "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true}, "class_name": "Conv2D"}], "keras_version": "2.1.6", "class_name": "Sequential", "backend": "tensorflow"}