{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.6", "config": [{"class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, null, null, 1]}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "padding": "same", "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "filters": 8, "activity_regularizer": null, "name": "conv2d_1", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "scale": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null, "name": "batch_normalization_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_1", "rate": 0.25, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "padding": "same", "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "filters": 8, "activity_regularizer": null, "name": "conv2d_2", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "scale": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null, "name": "batch_normalization_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_2", "rate": 0.25, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "padding": "same", "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "filters": 16, "activity_regularizer": null, "name": "conv2d_3", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "scale": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null, "name": "batch_normalization_3", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_3", "rate": 0.25, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "padding": "same", "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "filters": 16, "activity_regularizer": null, "name": "conv2d_4", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "scale": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null, "name": "batch_normalization_4", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_4", "rate": 0.25, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "padding": "same", "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "filters": 32, "activity_regularizer": null, "name": "conv2d_5", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "scale": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null, "name": "batch_normalization_5", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_5", "rate": 0.25, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "padding": "same", "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "filters": 32, "activity_regularizer": null, "name": "conv2d_6", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null}}, {"class_name": "UpSampling2D", "config": {"trainable": true, "size": [2, 2], "name": "up_sampling2d_1", "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "scale": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null, "name": "batch_normalization_6", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_6", "rate": 0.25, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "padding": "same", "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "filters": 32, "activity_regularizer": null, "name": "conv2d_7", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null}}, {"class_name": "UpSampling2D", "config": {"trainable": true, "size": [2, 2], "name": "up_sampling2d_2", "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "scale": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null, "name": "batch_normalization_7", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_7", "rate": 0.25, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "padding": "same", "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "filters": 16, "activity_regularizer": null, "name": "conv2d_8", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null}}, {"class_name": "UpSampling2D", "config": {"trainable": true, "size": [2, 2], "name": "up_sampling2d_3", "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "scale": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null, "name": "batch_normalization_8", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_8", "rate": 0.25, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "padding": "same", "bias_constraint": null, "activation": "sigmoid", "bias_regularizer": null, "kernel_constraint": null, "filters": 32, "activity_regularizer": null, "name": "conv2d_9", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null}}]}