{"backend": "tensorflow", "keras_version": "2.1.6", "class_name": "Sequential", "config": [{"class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, null, null, 1], "name": "input_1"}}, {"class_name": "Conv2D", "config": {"padding": "same", "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "filters": 8, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2]}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "gamma_regularizer": null, "name": "batch_normalization_1", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "axis": -1}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "seed": null, "name": "dropout_1", "noise_shape": null}}, {"class_name": "Conv2D", "config": {"padding": "same", "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "filters": 8, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "gamma_regularizer": null, "name": "batch_normalization_2", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "axis": -1}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "seed": null, "name": "dropout_2", "noise_shape": null}}, {"class_name": "Conv2D", "config": {"padding": "same", "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "filters": 16, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "gamma_regularizer": null, "name": "batch_normalization_3", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "axis": -1}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "seed": null, "name": "dropout_3", "noise_shape": null}}, {"class_name": "Conv2D", "config": {"padding": "same", "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "name": "conv2d_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "filters": 16, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2]}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "gamma_regularizer": null, "name": "batch_normalization_4", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "axis": -1}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "seed": null, "name": "dropout_4", "noise_shape": null}}, {"class_name": "Conv2D", "config": {"padding": "same", "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "name": "conv2d_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "filters": 32, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "gamma_regularizer": null, "name": "batch_normalization_5", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "axis": -1}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "seed": null, "name": "dropout_5", "noise_shape": null}}, {"class_name": "Conv2D", "config": {"padding": "same", "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "name": "conv2d_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "filters": 32, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2]}}, {"class_name": "Conv2DTranspose", "config": {"padding": "same", "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "name": "conv2d_transpose_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "filters": 32, "kernel_constraint": null, "trainable": true, "kernel_size": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2]}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "gamma_regularizer": null, "name": "batch_normalization_6", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "axis": -1}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "seed": null, "name": "dropout_6", "noise_shape": null}}, {"class_name": "Conv2D", "config": {"padding": "same", "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "name": "conv2d_7", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "filters": 32, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}}, {"class_name": "Conv2DTranspose", "config": {"padding": "same", "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "name": "conv2d_transpose_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "filters": 32, "kernel_constraint": null, "trainable": true, "kernel_size": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2]}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "gamma_regularizer": null, "name": "batch_normalization_7", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "axis": -1}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "seed": null, "name": "dropout_7", "noise_shape": null}}, {"class_name": "Conv2D", "config": {"padding": "same", "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "name": "conv2d_8", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "filters": 16, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}}, {"class_name": "Conv2DTranspose", "config": {"padding": "same", "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "name": "conv2d_transpose_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "filters": 32, "kernel_constraint": null, "trainable": true, "kernel_size": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2]}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "gamma_regularizer": null, "name": "batch_normalization_8", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "axis": -1}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "seed": null, "name": "dropout_8", "noise_shape": null}}, {"class_name": "Conv2D", "config": {"padding": "same", "dilation_rate": [1, 1], "activation": "sigmoid", "bias_constraint": null, "name": "conv2d_9", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "filters": 32, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}}]}