{"keras_version": "2.1.6", "config": [{"config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, null, null, 1]}, "class_name": "InputLayer"}, {"config": {"name": "conv2d_1", "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "kernel_constraint": null, "filters": 8, "bias_constraint": null, "padding": "same", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [2, 2], "dilation_rate": [1, 1], "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_1", "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "epsilon": 0.001, "center": true, "trainable": true, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"noise_shape": null, "name": "dropout_1", "rate": 0.25, "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "conv2d_2", "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "kernel_constraint": null, "filters": 8, "bias_constraint": null, "padding": "same", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "dilation_rate": [1, 1], "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_2", "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "epsilon": 0.001, "center": true, "trainable": true, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"noise_shape": null, "name": "dropout_2", "rate": 0.25, "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "conv2d_3", "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "kernel_constraint": null, "filters": 16, "bias_constraint": null, "padding": "same", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "dilation_rate": [1, 1], "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_3", "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "epsilon": 0.001, "center": true, "trainable": true, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"noise_shape": null, "name": "dropout_3", "rate": 0.25, "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "conv2d_4", "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "kernel_constraint": null, "filters": 16, "bias_constraint": null, "padding": "same", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [2, 2], "dilation_rate": [1, 1], "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_4", "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "epsilon": 0.001, "center": true, "trainable": true, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"noise_shape": null, "name": "dropout_4", "rate": 0.25, "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "conv2d_5", "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "kernel_constraint": null, "filters": 32, "bias_constraint": null, "padding": "same", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "dilation_rate": [1, 1], "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_5", "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "epsilon": 0.001, "center": true, "trainable": true, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"noise_shape": null, "name": "dropout_5", "rate": 0.25, "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "conv2d_6", "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "kernel_constraint": null, "filters": 32, "bias_constraint": null, "padding": "same", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [2, 2], "dilation_rate": [1, 1], "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_transpose_1", "data_format": "channels_last", "kernel_size": [2, 2], "use_bias": true, "kernel_constraint": null, "filters": 32, "bias_constraint": null, "padding": "same", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [2, 2], "activation": "relu"}, "class_name": "Conv2DTranspose"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_6", "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "epsilon": 0.001, "center": true, "trainable": true, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"noise_shape": null, "name": "dropout_6", "rate": 0.25, "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "conv2d_7", "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "kernel_constraint": null, "filters": 32, "bias_constraint": null, "padding": "same", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "dilation_rate": [1, 1], "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_transpose_2", "data_format": "channels_last", "kernel_size": [2, 2], "use_bias": true, "kernel_constraint": null, "filters": 32, "bias_constraint": null, "padding": "same", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [2, 2], "activation": "relu"}, "class_name": "Conv2DTranspose"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_7", "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "epsilon": 0.001, "center": true, "trainable": true, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"noise_shape": null, "name": "dropout_7", "rate": 0.25, "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "conv2d_8", "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "kernel_constraint": null, "filters": 16, "bias_constraint": null, "padding": "same", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "dilation_rate": [1, 1], "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_transpose_3", "data_format": "channels_last", "kernel_size": [2, 2], "use_bias": true, "kernel_constraint": null, "filters": 32, "bias_constraint": null, "padding": "same", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [2, 2], "activation": "relu"}, "class_name": "Conv2DTranspose"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_8", "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "epsilon": 0.001, "center": true, "trainable": true, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"noise_shape": null, "name": "dropout_8", "rate": 0.25, "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "conv2d_9", "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "kernel_constraint": null, "filters": 32, "bias_constraint": null, "padding": "same", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "dilation_rate": [1, 1], "activation": "sigmoid"}, "class_name": "Conv2D"}], "backend": "tensorflow", "class_name": "Sequential"}