{"keras_version": "2.1.6", "config": [{"config": {"batch_input_shape": [null, null, null, 1], "name": "input_1", "dtype": "float32", "sparse": false}, "class_name": "InputLayer"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_1", "activity_regularizer": null, "use_bias": true, "trainable": true, "filters": 8, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_size": [3, 3], "padding": "same", "strides": [2, 2], "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_2", "activity_regularizer": null, "use_bias": true, "trainable": true, "filters": 8, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_3", "activity_regularizer": null, "use_bias": true, "trainable": true, "filters": 16, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_4", "activity_regularizer": null, "use_bias": true, "trainable": true, "filters": 16, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_size": [3, 3], "padding": "same", "strides": [2, 2], "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_5", "activity_regularizer": null, "use_bias": true, "trainable": true, "filters": 32, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_6", "activity_regularizer": null, "use_bias": true, "trainable": true, "filters": 32, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_size": [3, 3], "padding": "same", "strides": [2, 2], "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "up_sampling2d_1", "size": [2, 2]}, "class_name": "UpSampling2D"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_7", "activity_regularizer": null, "use_bias": true, "trainable": true, "filters": 32, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "up_sampling2d_2", "size": [2, 2]}, "class_name": "UpSampling2D"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_8", "activity_regularizer": null, "use_bias": true, "trainable": true, "filters": 16, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "up_sampling2d_3", "size": [2, 2]}, "class_name": "UpSampling2D"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_9", "activity_regularizer": null, "use_bias": true, "trainable": true, "filters": 32, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "sigmoid", "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "bias_constraint": null}, "class_name": "Conv2D"}], "class_name": "Sequential", "backend": "tensorflow"}