{"class_name": "Sequential", "config": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, null, null, 1], "name": "input_1", "sparse": false}}, {"class_name": "Conv2D", "config": {"padding": "same", "activity_regularizer": null, "kernel_regularizer": null, "filters": 8, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_1", "activation": "relu", "strides": [2, 2], "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true}}, {"class_name": "Conv2D", "config": {"padding": "same", "activity_regularizer": null, "kernel_regularizer": null, "filters": 8, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_2", "activation": "relu", "strides": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true}}, {"class_name": "Conv2D", "config": {"padding": "same", "activity_regularizer": null, "kernel_regularizer": null, "filters": 16, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_3", "activation": "relu", "strides": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true}}, {"class_name": "Conv2D", "config": {"padding": "same", "activity_regularizer": null, "kernel_regularizer": null, "filters": 16, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_4", "activation": "relu", "strides": [2, 2], "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true}}, {"class_name": "Conv2D", "config": {"padding": "same", "activity_regularizer": null, "kernel_regularizer": null, "filters": 32, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_5", "activation": "relu", "strides": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true}}, {"class_name": "Conv2D", "config": {"padding": "same", "activity_regularizer": null, "kernel_regularizer": null, "filters": 32, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_6", "activation": "relu", "strides": [2, 2], "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true}}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_1", "trainable": true}}, {"class_name": "Conv2D", "config": {"padding": "same", "activity_regularizer": null, "kernel_regularizer": null, "filters": 32, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_7", "activation": "relu", "strides": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true}}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_2", "trainable": true}}, {"class_name": "Conv2D", "config": {"padding": "same", "activity_regularizer": null, "kernel_regularizer": null, "filters": 16, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_8", "activation": "relu", "strides": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true}}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_3", "trainable": true}}, {"class_name": "Conv2D", "config": {"padding": "same", "activity_regularizer": null, "kernel_regularizer": null, "filters": 32, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_9", "activation": "sigmoid", "strides": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true}}], "keras_version": "2.1.6", "backend": "tensorflow"}