{"keras_version": "2.1.6", "config": [{"config": {"name": "input_1", "batch_input_shape": [null, null, null, 1], "sparse": false, "dtype": "float32"}, "class_name": "InputLayer"}, {"config": {"data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "filters": 8, "name": "conv2d_1", "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "padding": "same", "bias_constraint": null, "trainable": true, "activation": "relu", "dilation_rate": [1, 1], "strides": [2, 2], "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "filters": 8, "name": "conv2d_2", "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "padding": "same", "bias_constraint": null, "trainable": true, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "filters": 16, "name": "conv2d_3", "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "padding": "same", "bias_constraint": null, "trainable": true, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "filters": 16, "name": "conv2d_4", "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "padding": "same", "bias_constraint": null, "trainable": true, "activation": "relu", "dilation_rate": [1, 1], "strides": [2, 2], "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "filters": 32, "name": "conv2d_5", "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "padding": "same", "bias_constraint": null, "trainable": true, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "filters": 32, "name": "conv2d_6", "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "padding": "same", "bias_constraint": null, "trainable": true, "activation": "relu", "dilation_rate": [1, 1], "strides": [2, 2], "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "up_sampling2d_1", "data_format": "channels_last", "trainable": true, "size": [2, 2]}, "class_name": "UpSampling2D"}, {"config": {"data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "filters": 32, "name": "conv2d_7", "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "padding": "same", "bias_constraint": null, "trainable": true, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "up_sampling2d_2", "data_format": "channels_last", "trainable": true, "size": [2, 2]}, "class_name": "UpSampling2D"}, {"config": {"data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "filters": 16, "name": "conv2d_8", "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "padding": "same", "bias_constraint": null, "trainable": true, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "up_sampling2d_3", "data_format": "channels_last", "trainable": true, "size": [2, 2]}, "class_name": "UpSampling2D"}, {"config": {"data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "filters": 32, "name": "conv2d_9", "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "padding": "same", "bias_constraint": null, "trainable": true, "activation": "sigmoid", "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null}, "class_name": "Conv2D"}], "class_name": "Sequential", "backend": "tensorflow"}